backend: tensorflow
class_name: Model
config:
  input_layers:
  - - input_9
    - 0
    - 0
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 784
      dtype: float32
      name: input_9
      sparse: false
    inbound_nodes: []
    name: input_9
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      name: dense_19
      trainable: true
      units: 400
      use_bias: true
    inbound_nodes:
    - - - input_9
        - 0
        - 0
        - {}
    name: dense_19
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      name: dense_20
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - dense_19
        - 0
        - 0
        - {}
    name: dense_20
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      name: dense_21
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - dense_20
        - 0
        - 0
        - {}
    name: dense_21
  - class_name: Dense
    config:
      activation: softmax
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      name: dense_22
      trainable: true
      units: 10
      use_bias: true
    inbound_nodes:
    - - - dense_21
        - 0
        - 0
        - {}
    name: dense_22
  name: model_8
  output_layers:
  - - dense_22
    - 0
    - 0
keras_version: 2.2.4-tf
