backend: tensorflow
class_name: Model
config:
  input_layers:
  - - input_11
    - 0
    - 0
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 784
      dtype: float32
      name: input_11
      sparse: false
    inbound_nodes: []
    name: input_11
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      name: dense_25
      trainable: true
      units: 1000
      use_bias: true
    inbound_nodes:
    - - - input_11
        - 0
        - 0
        - {}
    name: dense_25
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      name: dense_26
      trainable: true
      units: 100
      use_bias: true
    inbound_nodes:
    - - - dense_25
        - 0
        - 0
        - {}
    name: dense_26
  - class_name: Dense
    config:
      activation: softmax
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      name: dense_27
      trainable: true
      units: 10
      use_bias: true
    inbound_nodes:
    - - - dense_26
        - 0
        - 0
        - {}
    name: dense_27
  name: model_10
  output_layers:
  - - dense_27
    - 0
    - 0
keras_version: 2.2.4-tf
